In [3]:
# pandas are used to cleaning and analysing also visualizing --> tbble

In [6]:
!pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (1.4.2)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2021.3)
Requirement already satisfied: numpy>=1.18.5 in c:\programdata\anaconda3\lib\site-packages (from pandas) (1.21.5)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [7]:
import pandas as pd

In [8]:
import numpy as np

In [9]:
x = ["a","b","c","d","e"]
y = [1,2,3,4,5]
z = {1:"a",2:"b",3:"c",4:"d",5:"e"}

In [10]:
# series

In [15]:
a = pd.Series(x)

In [16]:
a

0    a
1    b
2    c
3    d
4    e
dtype: object

In [17]:
type(a)

pandas.core.series.Series

In [18]:
pd.Series(data = x, index = y)

1    a
2    b
3    c
4    d
5    e
dtype: object

In [20]:
pd.Series(x, y) # use in order

1    a
2    b
3    c
4    d
5    e
dtype: object

In [21]:
pd.Series(z) # dict to series

1    a
2    b
3    c
4    d
5    e
dtype: object

In [29]:
x = ["a","b","c","d","e"]
x1 = ["a","b","c","d","f"]

In [30]:
a = pd.Series(y, x)
b = pd.Series(y, x1)

In [31]:
a + b # same index value will be added

a    2.0
b    4.0
c    6.0
d    8.0
e    NaN
f    NaN
dtype: float64

In [32]:
x = ["a","b","c","d","e"]
x1 = ["a","b","c","d","e"]

In [33]:
a = pd.Series(y, x)
b = pd.Series(y, x1)

In [34]:
a + b

a     2
b     4
c     6
d     8
e    10
dtype: int64

In [38]:
a

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [37]:
a['c']

3

In [39]:
a['c':]

c    3
d    4
e    5
dtype: int64

In [40]:
# dataframes

In [41]:
# no series are dataframs or frames of series

In [42]:
a = [1,2,3,4]
b = [5,6,7,8]
c = [9,0,1,2]
d = [3,4,5,6]
e = [7,8,9,0]

In [45]:
df = pd.DataFrame([a,b,c,d,e],["A","B","C","D","E"],["W","X","Y","Z"]) #same num of row and coloumn (data, row, column)

In [46]:
df

   W  X  Y  Z
A  1  2  3  4
B  5  6  7  8
C  9  0  1  2
D  3  4  5  6
E  7  8  9  0

In [47]:
print("❤️❤️")

❤️❤️

In [48]:
# creating and deleting rows and columns in dataframes

In [49]:
df = pd.DataFrame([a,b,c,d,e],["A","B","C","D","E"],["W","X","Y","Z"]) #same num of row and coloumn (data, row, column)

In [51]:
df

   W  X  Y  Z
A  1  2  3  4
B  5  6  7  8
C  9  0  1  2
D  3  4  5  6
E  7  8  9  0

In [55]:
df["P"] = df["Y"] + df["Z"]

In [56]:
df

   W  X  Y  Z   P
A  1  2  3  4   7
B  5  6  7  8  15
C  9  0  1  2   3
D  3  4  5  6  11
E  7  8  9  0   9

In [57]:
# removing

In [60]:
df.drop("E") # deleted perform in duplicate

   W  X  Y  Z   P
A  1  2  3  4   7
B  5  6  7  8  15
C  9  0  1  2   3
D  3  4  5  6  11

In [61]:
df

   W  X  Y  Z   P
A  1  2  3  4   7
B  5  6  7  8  15
C  9  0  1  2   3
D  3  4  5  6  11
E  7  8  9  0   9

In [62]:
# to delete permenently

In [63]:
df.drop("E", inplace = True) # drop will delete index(row)

In [64]:
df

   W  X  Y  Z   P
A  1  2  3  4   7
B  5  6  7  8  15
C  9  0  1  2   3
D  3  4  5  6  11

In [65]:
# to delete column

In [77]:
df.drop("Z",axis=1, inplace = True)

In [78]:
df

   W  X  Y
A  1  2  3
B  5  6  7
C  9  0  1
D  3  4  5

In [71]:
# accessing element in dataframe

In [72]:
df["Y"] # column

A    3
B    7
C    1
D    5
Name: Y, dtype: int64

In [80]:
df.loc["A"] # loc --> location

W    1
X    2
Y    3
Name: A, dtype: int64

In [81]:
df

   W  X  Y
A  1  2  3
B  5  6  7
C  9  0  1
D  3  4  5

In [82]:
df.loc["C","W"]

9

In [86]:
# conditional accessing

In [87]:
df > 3

       W      X      Y
A  False  False  False
B   True   True   True
C   True  False  False
D  False   True   True

In [88]:
df[df > 3]

     W    X    Y
A  NaN  NaN  NaN
B  5.0  6.0  7.0
C  9.0  NaN  NaN
D  NaN  4.0  5.0

In [89]:
df[df["W"] > 3]

   W  X  Y
B  5  6  7
C  9  0  1

In [92]:
df[df["W"] > 3][["W","X"]]

   W  X
B  5  6
C  9  0

In [94]:
df[df["W"] > 8]["W"]

C    9
Name: W, dtype: int64

In [95]:
# more then one condion

In [98]:
df

   W  X  Y
A  1  2  3
B  5  6  7
C  9  0  1
D  3  4  5

In [99]:
df[(df["W"] > 3) & (df["X"] > 2)]

   W  X  Y
B  5  6  7

In [101]:
df[(df["W"] > 3) | (df["X"] > 2)]

   W  X  Y
B  5  6  7
C  9  0  1
D  3  4  5

In [102]:
# MISSING DATA

In [103]:
d = {"a":[1,2,3,4,5],"b":[6,7,8,9,np.nan],"c":[0,1,2,np.nan,np.nan],"d":[3,4,np.nan,np.nan,np.nan],"e":[5,np.nan,np.nan,np.nan,np.nan]}

In [104]:
d

{'a': [1, 2, 3, 4, 5],
 'b': [6, 7, 8, 9, nan],
 'c': [0, 1, 2, nan, nan],
 'd': [3, 4, nan, nan, nan],
 'e': [5, nan, nan, nan, nan]}

In [105]:
df = pd.DataFrame(d)

In [106]:
df

   a    b    c    d    e
0  1  6.0  0.0  3.0  5.0
1  2  7.0  1.0  4.0  NaN
2  3  8.0  2.0  NaN  NaN
3  4  9.0  NaN  NaN  NaN
4  5  NaN  NaN  NaN  NaN

In [107]:
df.dropna(axis=0) # 0 row and 1 for column

   a    b    c    d    e
0  1  6.0  0.0  3.0  5.0

In [108]:
df.dropna(axis=1)

   a
0  1
1  2
2  3
3  4
4  5

In [109]:
df

   a    b    c    d    e
0  1  6.0  0.0  3.0  5.0
1  2  7.0  1.0  4.0  NaN
2  3  8.0  2.0  NaN  NaN
3  4  9.0  NaN  NaN  NaN
4  5  NaN  NaN  NaN  NaN

In [110]:
df.dropna(thresh = 3)

   a    b    c    d    e
0  1  6.0  0.0  3.0  5.0
1  2  7.0  1.0  4.0  NaN
2  3  8.0  2.0  NaN  NaN

In [111]:
df.dropna(thresh = 4)

   a    b    c    d    e
0  1  6.0  0.0  3.0  5.0
1  2  7.0  1.0  4.0  NaN

In [112]:
# fill values

In [113]:
df.fillna(1)

   a    b    c    d    e
0  1  6.0  0.0  3.0  5.0
1  2  7.0  1.0  4.0  1.0
2  3  8.0  2.0  1.0  1.0
3  4  9.0  1.0  1.0  1.0
4  5  1.0  1.0  1.0  1.0

In [114]:
df

   a    b    c    d    e
0  1  6.0  0.0  3.0  5.0
1  2  7.0  1.0  4.0  NaN
2  3  8.0  2.0  NaN  NaN
3  4  9.0  NaN  NaN  NaN
4  5  NaN  NaN  NaN  NaN

In [115]:
df["b"].fillna(value= df["b"].mean()) #average value

0    6.0
1    7.0
2    8.0
3    9.0
4    7.5
Name: b, dtype: float64

In [116]:
df["c"].fillna(value= df["c"].mean()) #average value

0    0.0
1    1.0
2    2.0
3    1.0
4    1.0
Name: c, dtype: float64

In [117]:
df["e"].fillna(value= df["e"].mean()) #average value

0    5.0
1    5.0
2    5.0
3    5.0
4    5.0
Name: e, dtype: float64

In [118]:
# analysing data by groupby

In [121]:
p = {"item":["apple","apple","orange","orange","guns","guns"], "days":["mon","tue","wed","thur","fri","sat"], "sales":[100,80,200,100,5,10]}

In [122]:
p

{'item': ['apple', 'apple', 'orange', 'orange', 'guns', 'guns'],
 'days': ['mon', 'tue', 'wed', 'thur', 'fri', 'sat'],
 'sales': [100, 80, 200, 100, 5, 10]}

In [123]:
df  = pd.DataFrame(p)

In [124]:
df

     item  days  sales
0   apple   mon    100
1   apple   tue     80
2  orange   wed    200
3  orange  thur    100
4    guns   fri      5
5    guns   sat     10

In [126]:
x = df.groupby("item")

In [129]:
x.mean()

        sales
item
apple    90.0
guns      7.5
orange  150.0

In [132]:
x.sum()

        sales
item
apple     180
guns       15
orange    300

In [133]:
x.std()

            sales
item
apple   14.142136
guns     3.535534
orange  70.710678

In [134]:
x.count()

        days  sales
item
apple      2      2
guns       2      2
orange     2      2

In [135]:
df

     item  days  sales
0   apple   mon    100
1   apple   tue     80
2  orange   wed    200
3  orange  thur    100
4    guns   fri      5
5    guns   sat     10

In [137]:
x.describe()

       sales
       count   mean        std    min     25%    50%     75%    max
item
apple    2.0   90.0  14.142136   80.0   85.00   90.0   95.00  100.0
guns     2.0    7.5   3.535534    5.0    6.25    7.5    8.75   10.0
orange   2.0  150.0  70.710678  100.0  125.00  150.0  175.00  200.0

In [138]:
x.describe().transpose()

item              apple       guns      orange
sales count    2.000000   2.000000    2.000000
      mean    90.000000   7.500000  150.000000
      std     14.142136   3.535534   70.710678
      min     80.000000   5.000000  100.000000
      25%     85.000000   6.250000  125.000000
      50%     90.000000   7.500000  150.000000
      75%     95.000000   8.750000  175.000000
      max    100.000000  10.000000  200.000000

In [139]:
# joining

In [140]:
x1 = {"a":[1,2,3], "b":[5,6,7]}
y1 = {"c":[3,4,5], "d":[2,3,6]}

In [144]:
x = pd.DataFrame(x1, index = ["p1","p2","p3"])
y = pd.DataFrame(y1, index = ["p1","p2","p3"])

In [145]:
x

    a  b
p1  1  5
p2  2  6
p3  3  7

In [146]:
y

    c  d
p1  3  2
p2  4  3
p3  5  6

In [147]:
x.join(y)

    a  b  c  d
p1  1  5  3  2
p2  2  6  4  3
p3  3  7  5  6

In [152]:
x.join(y, how = "outer")

    a  b  c  d
p1  1  5  3  2
p2  2  6  4  3
p3  3  7  5  6